zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_bsp/mcu/rx14t/register_access/gnuc/iodefine.h
typedef struct st_gptw {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WP : 1;
			unsigned long STRWP : 1;
			unsigned long STPWP : 1;
			unsigned long CLRWP : 1;
			unsigned long CMNWP : 1;
			unsigned long  : 3;
			unsigned long PRKEY : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long PRKEY : 8;
			unsigned long  : 3;
			unsigned long CMNWP : 1;
			unsigned long CLRWP : 1;
			unsigned long STPWP : 1;
			unsigned long STRWP : 1;
			unsigned long WP : 1;
#endif
	} BIT;
	} GTWP;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSTRT0 : 1;
			unsigned long CSTRT1 : 1;
			unsigned long CSTRT2 : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long CSTRT2 : 1;
			unsigned long CSTRT1 : 1;
			unsigned long CSTRT0 : 1;
#endif
	} BIT;
	} GTSTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSTOP0 : 1;
			unsigned long CSTOP1 : 1;
			unsigned long CSTOP2 : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long CSTOP2 : 1;
			unsigned long CSTOP1 : 1;
			unsigned long CSTOP0 : 1;
#endif
	} BIT;
	} GTSTP;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCLR0 : 1;
			unsigned long CCLR1 : 1;
			unsigned long CCLR2 : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long CCLR2 : 1;
			unsigned long CCLR1 : 1;
			unsigned long CCLR0 : 1;
#endif
	} BIT;
	} GTCLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SSGTRGAR : 1;
			unsigned long SSGTRGAF : 1;
			unsigned long  : 6;
			unsigned long SSCARBL : 1;
			unsigned long SSCARBH : 1;
			unsigned long SSCAFBL : 1;
			unsigned long SSCAFBH : 1;
			unsigned long SSCBRAL : 1;
			unsigned long SSCBRAH : 1;
			unsigned long SSCBFAL : 1;
			unsigned long SSCBFAH : 1;
			unsigned long SSMTU0 : 1;
			unsigned long SSMTU4 : 1;
			unsigned long  : 13;
			unsigned long CSTRT : 1;
#else
			unsigned long CSTRT : 1;
			unsigned long  : 13;
			unsigned long SSMTU4 : 1;
			unsigned long SSMTU0 : 1;
			unsigned long SSCBFAH : 1;
			unsigned long SSCBFAL : 1;
			unsigned long SSCBRAH : 1;
			unsigned long SSCBRAL : 1;
			unsigned long SSCAFBH : 1;
			unsigned long SSCAFBL : 1;
			unsigned long SSCARBH : 1;
			unsigned long SSCARBL : 1;
			unsigned long  : 6;
			unsigned long SSGTRGAF : 1;
			unsigned long SSGTRGAR : 1;
#endif
	} BIT;
	} GTSSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PSGTRGAR : 1;
			unsigned long PSGTRGAF : 1;
			unsigned long  : 6;
			unsigned long PSCARBL : 1;
			unsigned long PSCARBH : 1;
			unsigned long PSCAFBL : 1;
			unsigned long PSCAFBH : 1;
			unsigned long PSCBRAL : 1;
			unsigned long PSCBRAH : 1;
			unsigned long PSCBFAL : 1;
			unsigned long PSCBFAH : 1;
			unsigned long  : 15;
			unsigned long CSTOP : 1;
#else
			unsigned long CSTOP : 1;
			unsigned long  : 15;
			unsigned long PSCBFAH : 1;
			unsigned long PSCBFAL : 1;
			unsigned long PSCBRAH : 1;
			unsigned long PSCBRAL : 1;
			unsigned long PSCAFBH : 1;
			unsigned long PSCAFBL : 1;
			unsigned long PSCARBH : 1;
			unsigned long PSCARBL : 1;
			unsigned long  : 6;
			unsigned long PSGTRGAF : 1;
			unsigned long PSGTRGAR : 1;
#endif
	} BIT;
	} GTPSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CSGTRGAR : 1;
			unsigned long CSGTRGAF : 1;
			unsigned long  : 6;
			unsigned long CSCARBL : 1;
			unsigned long CSCARBH : 1;
			unsigned long CSCAFBL : 1;
			unsigned long CSCAFBH : 1;
			unsigned long CSCBRAL : 1;
			unsigned long CSCBRAH : 1;
			unsigned long CSCBFAL : 1;
			unsigned long CSCBFAH : 1;
			unsigned long  : 8;
			unsigned long CSCMSC : 3;
			unsigned long  : 4;
			unsigned long CCLR : 1;
#else
			unsigned long CCLR : 1;
			unsigned long  : 4;
			unsigned long CSCMSC : 3;
			unsigned long  : 8;
			unsigned long CSCBFAH : 1;
			unsigned long CSCBFAL : 1;
			unsigned long CSCBRAH : 1;
			unsigned long CSCBRAL : 1;
			unsigned long CSCAFBH : 1;
			unsigned long CSCAFBL : 1;
			unsigned long CSCARBH : 1;
			unsigned long CSCARBL : 1;
			unsigned long  : 6;
			unsigned long CSGTRGAF : 1;
			unsigned long CSGTRGAR : 1;
#endif
	} BIT;
	} GTCSR;
	char           wk0[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ASGTRGAR : 1;
			unsigned long ASGTRGAF : 1;
			unsigned long  : 6;
			unsigned long ASCARBL : 1;
			unsigned long ASCARBH : 1;
			unsigned long ASCAFBL : 1;
			unsigned long ASCAFBH : 1;
			unsigned long ASCBRAL : 1;
			unsigned long ASCBRAH : 1;
			unsigned long ASCBFAL : 1;
			unsigned long ASCBFAH : 1;
			unsigned long  : 8;
			unsigned long ASOC : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ASOC : 1;
			unsigned long  : 8;
			unsigned long ASCBFAH : 1;
			unsigned long ASCBFAL : 1;
			unsigned long ASCBRAH : 1;
			unsigned long ASCBRAL : 1;
			unsigned long ASCAFBH : 1;
			unsigned long ASCAFBL : 1;
			unsigned long ASCARBH : 1;
			unsigned long ASCARBL : 1;
			unsigned long  : 6;
			unsigned long ASGTRGAF : 1;
			unsigned long ASGTRGAR : 1;
#endif
	} BIT;
	} GTICASR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BSGTRGAR : 1;
			unsigned long BSGTRGAF : 1;
			unsigned long  : 6;
			unsigned long BSCARBL : 1;
			unsigned long BSCARBH : 1;
			unsigned long BSCAFBL : 1;
			unsigned long BSCAFBH : 1;
			unsigned long BSCBRAL : 1;
			unsigned long BSCBRAH : 1;
			unsigned long BSCBFAL : 1;
			unsigned long BSCBFAH : 1;
			unsigned long  : 8;
			unsigned long BSOC : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long BSOC : 1;
			unsigned long  : 8;
			unsigned long BSCBFAH : 1;
			unsigned long BSCBFAL : 1;
			unsigned long BSCBRAH : 1;
			unsigned long BSCBRAL : 1;
			unsigned long BSCAFBH : 1;
			unsigned long BSCAFBL : 1;
			unsigned long BSCARBH : 1;
			unsigned long BSCARBL : 1;
			unsigned long  : 6;
			unsigned long BSGTRGAF : 1;
			unsigned long BSGTRGAR : 1;
#endif
	} BIT;
	} GTICBSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CST : 1;
			unsigned long  : 3;
			unsigned long AINV : 1;
			unsigned long BINV : 1;
			unsigned long  : 2;
			unsigned long ICDS : 1;
			unsigned long SCGTIOC : 1;
			unsigned long SSCGRP : 2;
			unsigned long  : 3;
			unsigned long SSCEN : 1;
			unsigned long MD : 3;
			unsigned long  : 4;
			unsigned long TPCS : 4;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long TPCS : 4;
			unsigned long  : 4;
			unsigned long MD : 3;
			unsigned long SSCEN : 1;
			unsigned long  : 3;
			unsigned long SSCGRP : 2;
			unsigned long SCGTIOC : 1;
			unsigned long ICDS : 1;
			unsigned long  : 2;
			unsigned long BINV : 1;
			unsigned long AINV : 1;
			unsigned long  : 3;
			unsigned long CST : 1;
#endif
	} BIT;
	} GTCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long UD : 1;
			unsigned long UDF : 1;
			unsigned long  : 14;
			unsigned long OADTY : 2;
			unsigned long OADTYF : 1;
			unsigned long OADTYR : 1;
			unsigned long  : 4;
			unsigned long OBDTY : 2;
			unsigned long OBDTYF : 1;
			unsigned long OBDTYR : 1;
			unsigned long OABDTYT : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long OABDTYT : 1;
			unsigned long OBDTYR : 1;
			unsigned long OBDTYF : 1;
			unsigned long OBDTY : 2;
			unsigned long  : 4;
			unsigned long OADTYR : 1;
			unsigned long OADTYF : 1;
			unsigned long OADTY : 2;
			unsigned long  : 14;
			unsigned long UDF : 1;
			unsigned long UD : 1;
#endif
	} BIT;
	} GTUDDTYC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GTIOA : 5;
			unsigned long  : 1;
			unsigned long OADFLT : 1;
			unsigned long OAHLD : 1;
			unsigned long OAE : 1;
			unsigned long OADF : 2;
			unsigned long  : 1;
			unsigned long PSYE : 1;
			unsigned long NFAEN : 1;
			unsigned long NFCSA : 2;
			unsigned long GTIOB : 5;
			unsigned long  : 1;
			unsigned long OBDFLT : 1;
			unsigned long OBHLD : 1;
			unsigned long OBE : 1;
			unsigned long OBDF : 2;
			unsigned long  : 2;
			unsigned long NFBEN : 1;
			unsigned long NFCSB : 2;
#else
			unsigned long NFCSB : 2;
			unsigned long NFBEN : 1;
			unsigned long  : 2;
			unsigned long OBDF : 2;
			unsigned long OBE : 1;
			unsigned long OBHLD : 1;
			unsigned long OBDFLT : 1;
			unsigned long  : 1;
			unsigned long GTIOB : 5;
			unsigned long NFCSA : 2;
			unsigned long NFAEN : 1;
			unsigned long PSYE : 1;
			unsigned long  : 1;
			unsigned long OADF : 2;
			unsigned long OAE : 1;
			unsigned long OAHLD : 1;
			unsigned long OADFLT : 1;
			unsigned long  : 1;
			unsigned long GTIOA : 5;
#endif
	} BIT;
	} GTIOR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GTINTA : 1;
			unsigned long GTINTB : 1;
			unsigned long GTINTC : 1;
			unsigned long GTINTD : 1;
			unsigned long GTINTE : 1;
			unsigned long GTINTF : 1;
			unsigned long GTINTPR : 2;
			unsigned long SCFA : 1;
			unsigned long SCFB : 1;
			unsigned long SCFC : 1;
			unsigned long SCFD : 1;
			unsigned long SCFE : 1;
			unsigned long SCFF : 1;
			unsigned long SCFPO : 1;
			unsigned long SCFPU : 1;
			unsigned long ADTRAUEN : 1;
			unsigned long ADTRADEN : 1;
			unsigned long ADTRBUEN : 1;
			unsigned long ADTRBDEN : 1;
			unsigned long  : 8;
			unsigned long GRPDTE : 1;
			unsigned long GRPABH : 1;
			unsigned long GRPABL : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long GRPABL : 1;
			unsigned long GRPABH : 1;
			unsigned long GRPDTE : 1;
			unsigned long  : 8;
			unsigned long ADTRBDEN : 1;
			unsigned long ADTRBUEN : 1;
			unsigned long ADTRADEN : 1;
			unsigned long ADTRAUEN : 1;
			unsigned long SCFPU : 1;
			unsigned long SCFPO : 1;
			unsigned long SCFF : 1;
			unsigned long SCFE : 1;
			unsigned long SCFD : 1;
			unsigned long SCFC : 1;
			unsigned long SCFB : 1;
			unsigned long SCFA : 1;
			unsigned long GTINTPR : 2;
			unsigned long GTINTF : 1;
			unsigned long GTINTE : 1;
			unsigned long GTINTD : 1;
			unsigned long GTINTC : 1;
			unsigned long GTINTB : 1;
			unsigned long GTINTA : 1;
#endif
	} BIT;
	} GTINTAD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TCFA : 1;
			unsigned long TCFB : 1;
			unsigned long TCFC : 1;
			unsigned long TCFD : 1;
			unsigned long TCFE : 1;
			unsigned long TCFF : 1;
			unsigned long TCFPO : 1;
			unsigned long TCFPU : 1;
			unsigned long ITCNT : 3;
			unsigned long  : 4;
			unsigned long TUCF : 1;
			unsigned long ADTRAUF : 1;
			unsigned long ADTRADF : 1;
			unsigned long ADTRBUF : 1;
			unsigned long ADTRBDF : 1;
			unsigned long  : 4;
			unsigned long ODF : 1;
			unsigned long  : 3;
			unsigned long DTEF : 1;
			unsigned long OABHF : 1;
			unsigned long OABLF : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long OABLF : 1;
			unsigned long OABHF : 1;
			unsigned long DTEF : 1;
			unsigned long  : 3;
			unsigned long ODF : 1;
			unsigned long  : 4;
			unsigned long ADTRBDF : 1;
			unsigned long ADTRBUF : 1;
			unsigned long ADTRADF : 1;
			unsigned long ADTRAUF : 1;
			unsigned long TUCF : 1;
			unsigned long  : 4;
			unsigned long ITCNT : 3;
			unsigned long TCFPU : 1;
			unsigned long TCFPO : 1;
			unsigned long TCFF : 1;
			unsigned long TCFE : 1;
			unsigned long TCFD : 1;
			unsigned long TCFC : 1;
			unsigned long TCFB : 1;
			unsigned long TCFA : 1;
#endif
	} BIT;
	} GTST;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BD : 4;
			unsigned long  : 4;
			unsigned long DBRTECA : 1;
			unsigned long DBRTSCA : 1;
			unsigned long DBRTECB : 1;
			unsigned long DBRTSCB : 1;
			unsigned long DBRTEADA : 1;
			unsigned long DBRTSADA : 1;
			unsigned long DBRTEADB : 1;
			unsigned long DBRTSADB : 1;
			unsigned long CCRA : 2;
			unsigned long CCRB : 2;
			unsigned long PR : 2;
			unsigned long CCRSWT : 1;
			unsigned long  : 1;
			unsigned long ADTTA : 2;
			unsigned long ADTDA : 1;
			unsigned long  : 1;
			unsigned long ADTTB : 2;
			unsigned long ADTDB : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long ADTDB : 1;
			unsigned long ADTTB : 2;
			unsigned long  : 1;
			unsigned long ADTDA : 1;
			unsigned long ADTTA : 2;
			unsigned long  : 1;
			unsigned long CCRSWT : 1;
			unsigned long PR : 2;
			unsigned long CCRB : 2;
			unsigned long CCRA : 2;
			unsigned long DBRTSADB : 1;
			unsigned long DBRTEADB : 1;
			unsigned long DBRTSADA : 1;
			unsigned long DBRTEADA : 1;
			unsigned long DBRTSCB : 1;
			unsigned long DBRTECB : 1;
			unsigned long DBRTSCA : 1;
			unsigned long DBRTECA : 1;
			unsigned long  : 4;
			unsigned long BD : 4;
#endif
	} BIT;
	} GTBER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ITLA : 1;
			unsigned long ITLB : 1;
			unsigned long ITLC : 1;
			unsigned long ITLD : 1;
			unsigned long ITLE : 1;
			unsigned long ITLF : 1;
			unsigned long IVTC : 2;
			unsigned long IVTT : 3;
			unsigned long  : 1;
			unsigned long ADTAL : 1;
			unsigned long  : 1;
			unsigned long ADTBL : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long ADTBL : 1;
			unsigned long  : 1;
			unsigned long ADTAL : 1;
			unsigned long  : 1;
			unsigned long IVTT : 3;
			unsigned long IVTC : 2;
			unsigned long ITLF : 1;
			unsigned long ITLE : 1;
			unsigned long ITLD : 1;
			unsigned long ITLC : 1;
			unsigned long ITLB : 1;
			unsigned long ITLA : 1;
#endif
	} BIT;
	} GTITC;
	unsigned long  GTCNT;
	unsigned long  GTCCRA;
	unsigned long  GTCCRB;
	unsigned long  GTCCRC;
	unsigned long  GTCCRE;
	unsigned long  GTCCRD;
	unsigned long  GTCCRF;
	unsigned long  GTPR;
	unsigned long  GTPBR;
	unsigned long  GTPDBR;
	unsigned long  GTADTRA;
	unsigned long  GTADTBRA;
	unsigned long  GTADTDBRA;
	unsigned long  GTADTRB;
	unsigned long  GTADTBRB;
	unsigned long  GTADTDBRB;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDE : 1;
			unsigned long  : 3;
			unsigned long TDBUE : 1;
			unsigned long TDBDE : 1;
			unsigned long  : 2;
			unsigned long TDFER : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long TDFER : 1;
			unsigned long  : 2;
			unsigned long TDBDE : 1;
			unsigned long TDBUE : 1;
			unsigned long  : 3;
			unsigned long TDE : 1;
#endif
	} BIT;
	} GTDTCR;
	unsigned long  GTDVU;
	unsigned long  GTDVD;
	unsigned long  GTDBU;
	unsigned long  GTDBD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SOS : 2;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long SOS : 2;
#endif
	} BIT;
	} GTSOS;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SOTR : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long SOTR : 1;
#endif
	} BIT;
	} GTSOTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ADSMS0 : 2;
			unsigned long  : 6;
			unsigned long ADSMEN0 : 1;
			unsigned long  : 7;
			unsigned long ADSMS1 : 2;
			unsigned long  : 6;
			unsigned long ADSMEN1 : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long ADSMEN1 : 1;
			unsigned long  : 6;
			unsigned long ADSMS1 : 2;
			unsigned long  : 7;
			unsigned long ADSMEN0 : 1;
			unsigned long  : 6;
			unsigned long ADSMS0 : 2;
#endif
	} BIT;
	} GTADSMR;
	char           wk1[40];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SECSEL0 : 1;
			unsigned long SECSEL1 : 1;
			unsigned long SECSEL2 : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long SECSEL2 : 1;
			unsigned long SECSEL1 : 1;
			unsigned long SECSEL0 : 1;
#endif
	} BIT;
	} GTSECSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SBDCE : 1;
			unsigned long SBDPE : 1;
			unsigned long SBDAE : 1;
			unsigned long SBDDE : 1;
			unsigned long  : 4;
			unsigned long SBDCD : 1;
			unsigned long SBDPD : 1;
			unsigned long SBDAD : 1;
			unsigned long SBDDD : 1;
			unsigned long  : 5;
			unsigned long SSCE : 1;
			unsigned long  : 7;
			unsigned long SSCD : 1;
			unsigned long  : 6;
#else
			unsigned long  : 6;
			unsigned long SSCD : 1;
			unsigned long  : 7;
			unsigned long SSCE : 1;
			unsigned long  : 5;
			unsigned long SBDDD : 1;
			unsigned long SBDAD : 1;
			unsigned long SBDPD : 1;
			unsigned long SBDCD : 1;
			unsigned long  : 4;
			unsigned long SBDDE : 1;
			unsigned long SBDAE : 1;
			unsigned long SBDPE : 1;
			unsigned long SBDCE : 1;
#endif
	} BIT;
	} GTSECR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCTCA : 1;
			unsigned long CCTCB : 1;
			unsigned long CCTPR : 1;
			unsigned long CCTADA : 1;
			unsigned long CCTADB : 1;
			unsigned long CCTDV : 1;
			unsigned long  : 2;
			unsigned long CMTCA : 2;
			unsigned long CMTCB : 2;
			unsigned long  : 1;
			unsigned long CMTADA : 1;
			unsigned long CMTADB : 1;
			unsigned long  : 1;
			unsigned long CPTCA : 1;
			unsigned long CPTCB : 1;
			unsigned long CPTPR : 1;
			unsigned long CPTADA : 1;
			unsigned long CPTADB : 1;
			unsigned long CPTDV : 1;
			unsigned long  : 10;
#else
			unsigned long  : 10;
			unsigned long CPTDV : 1;
			unsigned long CPTADB : 1;
			unsigned long CPTADA : 1;
			unsigned long CPTPR : 1;
			unsigned long CPTCB : 1;
			unsigned long CPTCA : 1;
			unsigned long  : 1;
			unsigned long CMTADB : 1;
			unsigned long CMTADA : 1;
			unsigned long  : 1;
			unsigned long CMTCB : 2;
			unsigned long CMTCA : 2;
			unsigned long  : 2;
			unsigned long CCTDV : 1;
			unsigned long CCTADB : 1;
			unsigned long CCTADA : 1;
			unsigned long CCTPR : 1;
			unsigned long CCTCB : 1;
			unsigned long CCTCA : 1;
#endif
	} BIT;
	} GTBER2;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ICAFA : 1;
			unsigned long ICAFB : 1;
			unsigned long ICAFC : 1;
			unsigned long ICAFD : 1;
			unsigned long ICAFE : 1;
			unsigned long ICAFF : 1;
			unsigned long ICAFPO : 1;
			unsigned long ICAFPU : 1;
			unsigned long ICACLK : 1;
			unsigned long  : 5;
			unsigned long ICAGRP : 2;
			unsigned long ICBFA : 1;
			unsigned long ICBFB : 1;
			unsigned long ICBFC : 1;
			unsigned long ICBFD : 1;
			unsigned long ICBFE : 1;
			unsigned long ICBFF : 1;
			unsigned long ICBFPO : 1;
			unsigned long ICBFPU : 1;
			unsigned long ICBCLK : 1;
			unsigned long  : 5;
			unsigned long ICBGRP : 2;
#else
			unsigned long ICBGRP : 2;
			unsigned long  : 5;
			unsigned long ICBCLK : 1;
			unsigned long ICBFPU : 1;
			unsigned long ICBFPO : 1;
			unsigned long ICBFF : 1;
			unsigned long ICBFE : 1;
			unsigned long ICBFD : 1;
			unsigned long ICBFC : 1;
			unsigned long ICBFB : 1;
			unsigned long ICBFA : 1;
			unsigned long ICAGRP : 2;
			unsigned long  : 5;
			unsigned long ICACLK : 1;
			unsigned long ICAFPU : 1;
			unsigned long ICAFPO : 1;
			unsigned long ICAFF : 1;
			unsigned long ICAFE : 1;
			unsigned long ICAFD : 1;
			unsigned long ICAFC : 1;
			unsigned long ICAFB : 1;
			unsigned long ICAFA : 1;
#endif
	} BIT;
	} GTICCR;
} st_gptw_t;

typedef struct st_icu {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char IR : 1;
#endif
	} BIT;
	} IR[256];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTCE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTCE : 1;
#endif
	} BIT;
	} DTCER[256];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IEN0 : 1;
			unsigned char IEN1 : 1;
			unsigned char IEN2 : 1;
			unsigned char IEN3 : 1;
			unsigned char IEN4 : 1;
			unsigned char IEN5 : 1;
			unsigned char IEN6 : 1;
			unsigned char IEN7 : 1;
#else
			unsigned char IEN7 : 1;
			unsigned char IEN6 : 1;
			unsigned char IEN5 : 1;
			unsigned char IEN4 : 1;
			unsigned char IEN3 : 1;
			unsigned char IEN2 : 1;
			unsigned char IEN1 : 1;
			unsigned char IEN0 : 1;
#endif
	} BIT;
	} IER[32];
	char           wk0[192];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWINT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SWINT : 1;
#endif
	} BIT;
	} SWINTR;
	char           wk1[15];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FVCT : 8;
			unsigned short  : 7;
			unsigned short FIEN : 1;
#else
			unsigned short FIEN : 1;
			unsigned short  : 7;
			unsigned short FVCT : 8;
#endif
	} BIT;
	} FIR;
	char           wk2[14];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IPR : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char IPR : 4;
#endif
	} BIT;
	} IPR[256];
	char           wk3[256];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 2;
			unsigned char IRQMD : 2;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char IRQMD : 2;
			unsigned char  : 2;
#endif
	} BIT;
	} IRQCR[8];
	char           wk4[8];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FLTEN0 : 1;
			unsigned char FLTEN1 : 1;
			unsigned char FLTEN2 : 1;
			unsigned char FLTEN3 : 1;
			unsigned char FLTEN4 : 1;
			unsigned char FLTEN5 : 1;
			unsigned char FLTEN6 : 1;
			unsigned char FLTEN7 : 1;
#else
			unsigned char FLTEN7 : 1;
			unsigned char FLTEN6 : 1;
			unsigned char FLTEN5 : 1;
			unsigned char FLTEN4 : 1;
			unsigned char FLTEN3 : 1;
			unsigned char FLTEN2 : 1;
			unsigned char FLTEN1 : 1;
			unsigned char FLTEN0 : 1;
#endif
	} BIT;
	} IRQFLTE0;
	char           wk5[3];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short FCLKSEL0 : 2;
			unsigned short FCLKSEL1 : 2;
			unsigned short FCLKSEL2 : 2;
			unsigned short FCLKSEL3 : 2;
			unsigned short FCLKSEL4 : 2;
			unsigned short FCLKSEL5 : 2;
			unsigned short FCLKSEL6 : 2;
			unsigned short FCLKSEL7 : 2;
#else
			unsigned short FCLKSEL7 : 2;
			unsigned short FCLKSEL6 : 2;
			unsigned short FCLKSEL5 : 2;
			unsigned short FCLKSEL4 : 2;
			unsigned short FCLKSEL3 : 2;
			unsigned short FCLKSEL2 : 2;
			unsigned short FCLKSEL1 : 2;
			unsigned short FCLKSEL0 : 2;
#endif
	} BIT;
	} IRQFLTC0;
	char           wk6[106];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NMIST : 1;
			unsigned char OSTST : 1;
			unsigned char  : 1;
			unsigned char IWDTST : 1;
			unsigned char LVD1ST : 1;
			unsigned char LVD2ST : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char LVD2ST : 1;
			unsigned char LVD1ST : 1;
			unsigned char IWDTST : 1;
			unsigned char  : 1;
			unsigned char OSTST : 1;
			unsigned char NMIST : 1;
#endif
	} BIT;
	} NMISR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NMIEN : 1;
			unsigned char OSTEN : 1;
			unsigned char  : 1;
			unsigned char IWDTEN : 1;
			unsigned char LVD1EN : 1;
			unsigned char LVD2EN : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char LVD2EN : 1;
			unsigned char LVD1EN : 1;
			unsigned char IWDTEN : 1;
			unsigned char  : 1;
			unsigned char OSTEN : 1;
			unsigned char NMIEN : 1;
#endif
	} BIT;
	} NMIER;
	union {
		unsigned char BYTE;
		struct {
			
