zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_bsp/mcu/rx14t/register_access/gnuc/iodefine.h
typedef struct st_ofsm {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDE : 3;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long MDE : 3;
#endif
	} BIT;
	} MDE;
	char           wk0[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VDSEL : 2;
			unsigned long LVDAS : 1;
			unsigned long FASTSTUP : 1;
			unsigned long  : 4;
			unsigned long HOCOEN : 1;
			unsigned long  : 3;
			unsigned long HOCOFRQ : 2;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long HOCOFRQ : 2;
			unsigned long  : 3;
			unsigned long HOCOEN : 1;
			unsigned long  : 4;
			unsigned long FASTSTUP : 1;
			unsigned long LVDAS : 1;
			unsigned long VDSEL : 2;
#endif
	} BIT;
	} OFS1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long IWDTSTRT : 1;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long  : 1;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 1;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTSTRT : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} OFS0;
} st_ofsm_t;

typedef struct st_pga {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 2;
			unsigned short PGA0EN : 1;
			unsigned short  : 3;
			unsigned short PGA1EN : 1;
			unsigned short  : 3;
			unsigned short PGA2EN : 1;
			unsigned short  : 1;
			unsigned short PGA0GND : 1;
			unsigned short PGA1GND : 1;
			unsigned short PGA2GND : 1;
			unsigned short  : 1;
#else
			unsigned short  : 1;
			unsigned short PGA2GND : 1;
			unsigned short PGA1GND : 1;
			unsigned short PGA0GND : 1;
			unsigned short  : 1;
			unsigned short PGA2EN : 1;
			unsigned short  : 3;
			unsigned short PGA1EN : 1;
			unsigned short  : 3;
			unsigned short PGA0EN : 1;
			unsigned short  : 2;
#endif
	} BIT;
	} PGACR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short PGA0GAIN : 2;
			unsigned short  : 2;
			unsigned short PGA1GAIN : 2;
			unsigned short  : 2;
			unsigned short PGA2GAIN : 2;
			unsigned short  : 6;
#else
			unsigned short  : 6;
			unsigned short PGA2GAIN : 2;
			unsigned short  : 2;
			unsigned short PGA1GAIN : 2;
			unsigned short  : 2;
			unsigned short PGA0GAIN : 2;
#endif
	} BIT;
	} PGAGS0;
	char           wk0[60];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PGAMON : 1;
			unsigned char  : 3;
			unsigned char MONSEL : 4;
#else
			unsigned char MONSEL : 4;
			unsigned char  : 3;
			unsigned char PGAMON : 1;
#endif
	} BIT;
	} PGAMONCR;
} st_pga_t;

typedef struct st_poe {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE0M : 4;
			unsigned short POE0M2 : 4;
			unsigned short PIE1 : 1;
			unsigned short  : 3;
			unsigned short POE0F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE0F : 1;
			unsigned short  : 3;
			unsigned short PIE1 : 1;
			unsigned short POE0M2 : 4;
			unsigned short POE0M : 4;
#endif
	} BIT;
	} ICSR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE1 : 1;
			unsigned short OCE1 : 1;
			unsigned short  : 5;
			unsigned short OSF1 : 1;
#else
			unsigned short OSF1 : 1;
			unsigned short  : 5;
			unsigned short OCE1 : 1;
			unsigned short OIE1 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR1;
	char           wk0[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE8M : 4;
			unsigned short POE8M2 : 4;
			unsigned short PIE3 : 1;
			unsigned short POE8E : 1;
			unsigned short  : 2;
			unsigned short POE8F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE8F : 1;
			unsigned short  : 2;
			unsigned short POE8E : 1;
			unsigned short PIE3 : 1;
			unsigned short POE8M2 : 4;
			unsigned short POE8M : 4;
#endif
	} BIT;
	} ICSR3;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MTU0AZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0DZE : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char MTU0DZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0AZE : 1;
#endif
	} BIT;
	} POECR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short MTU4BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU3BDZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short MTU3BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU4BDZE : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} POECR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GPT0ABZE : 1;
			unsigned short GPT1ABZE : 1;
			unsigned short GPT2ABZE : 1;
			unsigned short  : 13;
#else
			unsigned short  : 13;
			unsigned short GPT2ABZE : 1;
			unsigned short GPT1ABZE : 1;
			unsigned short GPT0ABZE : 1;
#endif
	} BIT;
	} POECR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT34ZE : 1;
			unsigned short IC1ADDMT34ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short IC6ADDMT34ZE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short IC6ADDMT34ZE : 1;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDMT34ZE : 1;
			unsigned short CMADDMT34ZE : 1;
#endif
	} BIT;
	} POECR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT0ZE : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDMT0ZE : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short IC6ADDMT0ZE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short IC6ADDMT0ZE : 1;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short IC3ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short CMADDMT0ZE : 1;
#endif
	} BIT;
	} POECR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT01ZE : 1;
			unsigned short IC1ADDGPT01ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDGPT01ZE : 1;
			unsigned short IC4ADDGPT01ZE : 1;
			unsigned short IC5ADDGPT01ZE : 1;
			unsigned short IC6ADDGPT01ZE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short IC6ADDGPT01ZE : 1;
			unsigned short IC5ADDGPT01ZE : 1;
			unsigned short IC4ADDGPT01ZE : 1;
			unsigned short IC3ADDGPT01ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDGPT01ZE : 1;
			unsigned short CMADDGPT01ZE : 1;
#endif
	} BIT;
	} POECR6;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE10M : 4;
			unsigned short POE10M2 : 4;
			unsigned short PIE4 : 1;
			unsigned short POE10E : 1;
			unsigned short  : 2;
			unsigned short POE10F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE10F : 1;
			unsigned short  : 2;
			unsigned short POE10E : 1;
			unsigned short PIE4 : 1;
			unsigned short POE10M2 : 4;
			unsigned short POE10M : 4;
#endif
	} BIT;
	} ICSR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE11M : 4;
			unsigned short POE11M2 : 4;
			unsigned short PIE5 : 1;
			unsigned short POE11E : 1;
			unsigned short  : 2;
			unsigned short POE11F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE11F : 1;
			unsigned short  : 2;
			unsigned short POE11E : 1;
			unsigned short PIE5 : 1;
			unsigned short POE11M2 : 4;
			unsigned short POE11M : 4;
#endif
	} BIT;
	} ICSR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 9;
			unsigned short OSTSTE : 1;
			unsigned short  : 2;
			unsigned short OSTSTF : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short OSTSTF : 1;
			unsigned short  : 2;
			unsigned short OSTSTE : 1;
			unsigned short  : 9;
#endif
	} BIT;
	} ICSR6;
	char           wk2[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE12M : 4;
			unsigned short POE12M2 : 4;
			unsigned short PIE7 : 1;
			unsigned short POE12E : 1;
			unsigned short  : 2;
			unsigned short POE12F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE12F : 1;
			unsigned short  : 2;
			unsigned short POE12E : 1;
			unsigned short PIE7 : 1;
			unsigned short POE12M2 : 4;
			unsigned short POE12M : 4;
#endif
	} BIT;
	} ICSR7;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short C0FLAG : 1;
			unsigned short C1FLAG : 1;
			unsigned short C2FLAG : 1;
			unsigned short  : 13;
#else
			unsigned short  : 13;
			unsigned short C2FLAG : 1;
			unsigned short C1FLAG : 1;
			unsigned short C0FLAG : 1;
#endif
	} BIT;
	} POECMPFR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POEREQ0 : 1;
			unsigned short POEREQ1 : 1;
			unsigned short POEREQ2 : 1;
			unsigned short  : 13;
#else
			unsigned short  : 13;
			unsigned short POEREQ2 : 1;
			unsigned short POEREQ1 : 1;
			unsigned short POEREQ0 : 1;
#endif
	} BIT;
	} POECMPSEL;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE3 : 1;
			unsigned short OCE3 : 1;
			unsigned short  : 5;
			unsigned short OSF3 : 1;
#else
			unsigned short OSF3 : 1;
			unsigned short  : 5;
			unsigned short OCE3 : 1;
			unsigned short OIE3 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTUCH34HIZ : 1;
			unsigned short  : 1;
			unsigned short MTUCH0HIZ : 1;
			unsigned short GPT01HIZ : 1;
			unsigned short GPT23HIZ : 1;
			unsigned short  : 3;
			unsigned short GPT02HIZ : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short GPT02HIZ : 1;
			unsigned short  : 3;
			unsigned short GPT23HIZ : 1;
			unsigned short GPT01HIZ : 1;
			unsigned short MTUCH0HIZ : 1;
			unsigned short  : 1;
			unsigned short MTUCH34HIZ : 1;
#endif
	} BIT;
	} SPOER;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU0AME : 1;
			unsigned short MTU0BME : 1;
			unsigned short MTU0CME : 1;
			unsigned short MTU0DME : 1;
			unsigned short  : 12;
#else
			unsigned short  : 12;
			unsigned short MTU0DME : 1;
			unsigned short MTU0CME : 1;
			unsigned short MTU0BME : 1;
			unsigned short MTU0AME : 1;
#endif
	} BIT;
	} PMMCR0;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short MTU4BME : 1;
			unsigned short MTU4AME : 1;
			unsigned short MTU3BME : 1;
			unsigned short MTU4DME : 1;
			unsigned short MTU4CME : 1;
			unsigned short MTU3DME : 1;
			unsigned short  : 2;
#else
			unsigned short  : 2;
			unsigned short MTU3DME : 1;
			unsigned short MTU4CME : 1;
			unsigned short MTU4DME : 1;
			unsigned short MTU3BME : 1;
			unsigned short MTU4AME : 1;
			unsigned short MTU4BME : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} PMMCR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GPT0AME : 1;
			unsigned short GPT0BME : 1;
			unsigned short GPT1AME : 1;
			unsigned short GPT1BME : 1;
			unsigned short GPT2AME : 1;
			unsigned short GPT2BME : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short GPT2BME : 1;
			unsigned short GPT2AME : 1;
			unsigned short GPT1BME : 1;
			unsigned short GPT1AME : 1;
			unsigned short GPT0BME : 1;
			unsigned short GPT0AME : 1;
#endif
	} BIT;
	} PMMCR2;
	char           wk4[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX0;
	char           wk5[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX2;
	char           wk6[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX5;
	char           wk7[18];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT23ZE : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short CMADDGPT23ZE : 1;
#endif
	} BIT;
	} POECR6B;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT02ZE : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short  : 9;
#else
			unsigned short  : 9;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short CMADDGPT02ZE : 1;
#endif
	} BIT;
	} POECR9;
	char           wk8[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX6;
	char           wk9[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE0MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE0MS : 6;
#endif
	} BIT;
	} IMCR0;
	char           wk10[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE8MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE8MS : 6;
#endif
	} BIT;
	} IMCR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE10MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE10MS : 6;
#endif
	} BIT;
	} IMCR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0ASEL : 4;
			unsigned char M0BSEL : 4;
#else
			unsigned char M0BSEL : 4;
			unsigned char M0ASEL : 4;
#endif
	} BIT;
	} M0SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0CSEL : 4;
			unsigned char M0DSEL : 4;
#else
			unsigned char M0DSEL : 4;
			unsigned char M0CSEL : 4;
#endif
	} BIT;
	} M0SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M3BSEL : 4;
			unsigned char M3DSEL : 4;
#else
			unsigned char M3DSEL : 4;
			unsigned char M3BSEL : 4;
#endif
	} BIT;
	} M3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4ASEL : 4;
			unsigned char M4CSEL : 4;
#else
			unsigned char M4CSEL : 4;
			unsigned char M4ASEL : 4;
#endif
	} BIT;
	} M4SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4BSEL : 4;
			unsigned char M4DSEL : 4;
#else
			unsigned char M4DSEL : 4;
			unsigned char M4BSEL : 4;
#endif
	} BIT;
	} M4SELR2;
	char           wk11[5];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G0ASEL : 4;
			unsigned char G0BSEL : 4;
#else
			unsigned char G0BSEL : 4;
			unsigned char G0ASEL : 4;
#endif
	} BIT;
	} G0SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G1ASEL : 4;
			unsigned char G1BSEL : 4;
#else
			unsigned char G1BSEL : 4;
			unsigned char G1ASEL : 4;
#endif
	} BIT;
	} G1SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G2ASEL : 4;
			unsigned char G2BSEL : 4;
#else
			unsigned char G2BSEL : 4;
			unsigned char G2ASEL : 4;
#endif
	} BIT;
	} G2SELR;
	char           wk12[7];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE11MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE11MS : 6;
#endif
	} BIT;
	} IMCR4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE12MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE12MS : 6;
#endif
	} BIT;
	} IMCR5;
	char           wk13[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP0MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP0MS : 6;
#endif
	} BIT;
	} IMCR9;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP1MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP1MS : 6;
#endif
	} BIT;
	} IMCR10;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP2MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP2MS : 6;
#endif
	} BIT;
	} IMCR11;
} st_poe_t;

typedef struct st_poeg {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long  : 5;
			unsigned long ST : 1;
			unsigned long  : 7;
			unsigned long NFPSC : 1;
			unsigned long ELSEL : 1;
			unsigned long NFSN : 2;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long NFSN : 2;
			unsigned long ELSEL : 1;
			unsigned long NFPSC : 1;
			unsigned long  : 7;
			unsigned long ST : 1;
			unsigned long  : 5;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGA;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSEL : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long MSEL : 5;
#endif
	} BIT;
	} POEGICRA;
	char           wk0[56];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPA;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 2;
			unsigned short MSEL : 5;
#else
			unsigned short MSEL : 5;
			unsigned short  : 2;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRA;
} st_poeg_t;

typedef struct st_port0 {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char B0 : 1;
			unsigned char B1 : 1;
			unsigned char B2 : 1;
			unsigned char B3 : 1;
			unsigned char B4 : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char B4 : 1;
			unsigned char B3 : 1;
			unsigned char B2 : 1;
			unsigned char B1 : 1;
			unsigned char B0 : 1;
#endif
	} BIT;
	} PODR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			
